Revit 2026 API

# BalusterInfo Class

---

The class represents an instance of a railing baluster or post.

SystemObject Autodesk.Revit.DB.ArchitectureBalusterInfo

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BalusterInfo : IDisposable
```
```vb
Public Class BalusterInfo
	Implements IDisposable
```
```cpp
public ref class BalusterInfo : IDisposable
```
```fsharp
type BalusterInfo =
    class
        interface IDisposable
    end
```

The BalusterInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BalusterFamilyId | The id of the family used for the baluster or post. |
|  | BaseOffset | The offset from the base reference. |
|  | BaseReferenceName | Represents the name of the reference for the bottom of this baluster or post. |
|  | DistanceFromPreviousOrSpace | The length, in case of balusters, it is a distance from a previous one. For a post, it is a space from the original position of the post. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the baluster. |
|  | Offset | The side offset of the baluster/post from the railing path. |
|  | TopOffset | The offset from the top reference. |
|  | TopReferenceName | Represents the name of the reference for the top of this baluster or post. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the BalusterInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetReferenceNameForHost | Gets the name string to be used as a reference to Host in the current language. |
|  | GetReferenceNameForTopRail | Gets the name string to be used as a reference to Top Rail in the current language. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Architecture Namespace